Catalogs/Сертификаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Сертификаты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСертификата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСертификатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСертификата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоминалПогашения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/УправлениеСертификатами/Ext/Module.bsl
////////////////////////////////// Сертификаты ///////////////////////////////////////////////////////
 // Игорь 15.09.2011 15:22:52
 Функция ОбработкаСертификатовПередЗаписью(Источник, Отказ, РежимЗаписи) Экспорт
	 Если не Отказ Тогда
		 Если РежимЗаписи <> РежимЗаписиДокумента.Запись Тогда		 	 			 		 						 		
			 Если  ЗначениеЗаполнено(Источник.Сертификат) Тогда 
				 Если не Источник.ссылка.проведен и РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда  	
					 Если не Источник.Сертификат.Актуальность Тогда
						 ТекстСообщения = ПолучитьТекстСКодомИНомеромСертификата(Источник.Сертификат); 
						 ОбщегоНазначения.ВывестиОшибку(НСтр("ru='Отмена проведения ! 
						|Сертификат "+ ТекстСообщения +" не актуален. ';uk='Відміна проведення ! 
						|Сертифікат "+ ТекстСообщения +"не актуальний. '"));
						 Возврат Ложь; 
					 КонецЕсли;		 
				 КонецЕсли;	
				 ИзмененниеАктуальностиСертификатов(РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения, Источник.Сертификат);  
			 КонецЕсли;		 	 
		 КонецЕсли;                                                           
	 КонецЕсли;
	 Возврат Истина;
	 
 КонецФункции
 
 // Игорь 15.09.2011 15:23:00
 Процедура ИзмененниеАктуальностиСертификатов(Актуальность, Сертификат) 
	 
	 ОбъектСертификат = Сертификат.ПолучитьОбъект();      
	 ОбъектСертификат.Актуальность = Актуальность;
	 Попытка
		 ОбъектСертификат.Записать();
	 Исключение
		 Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
	 КонецПопытки;
	 
 КонецПроцедуры
 
 // Игорь 15.09.2011 15:23:04
 Функция  ПолучитьТекстСКодомИНомеромСертификата(Сертификат, ЧтоВозвращаем="НаименованиеИКод") Экспорт 
	Если ЧтоВозвращаем = "НаименованиеИКод" Тогда
		Возврат СокрЛП(Сертификат.Наименование) + " № " + СокрЛП(Строка(Сертификат.КодСертификата))+" ";
	ИначеЕсли ЧтоВозвращаем = "КодДисконтнаяКарта"  Тогда
		Возврат  СокрЛП(Строка(Сертификат.ДисконтнаяКарта.КодКарты));
	КонецЕсли; 	 				 
 КонецФункции
                                                              
 // Игорь 15.09.2011 15:23:08
 Функция ПолучитьТекстЗапросаПоСертификатам(УсловиеПоиска = Неопределено, Количество = 0) Экспорт	 
	 Текст = "ВЫБРАТЬ
	 |	Сертификаты.Ссылка
	 |ИЗ
	 |	Справочник.Сертификаты КАК Сертификаты
	 |ГДЕ                                                          
	 |	(НЕ Сертификаты.ПометкаУдаления)
	 |	И Сертификаты.Актуальность
	 |	И (НЕ Сертификаты.ЭтоГруппа)
	 |	И Сертификаты.Ссылка = &Значение";
	 
	 Если УсловиеПоиска = "ПоКодуСертификата" Тогда
		 Текст = СтрЗаменить(Текст , "И Сертификаты.Ссылка = &Значение", "И Сертификаты.КодСертификата ПОДОБНО &Значение")                                 
	 КонецЕсли;
	 Если  Количество > 0 Тогда
	      Текст = СтрЗаменить(Текст , "ВЫБРАТЬ", "ВЫБРАТЬ ПЕРВЫЕ " + Количество)  
	 КонецЕсли;
	 Возврат Текст;
	 
 КонецФункции
 
 // Игорь 15.09.2011 15:21:51
 Процедура  ПроверкаСертификатовВДокументеБэк(ЭтотОбъект, ЭлементыФормы, Позиции, ЭлементЗначение = Неопределено)  Экспорт	 
	 
	 //Костенюк Александр-Старт 18.09.2012
	 // Процедура отключена
	 // Неверное применение
	 Возврат;
	 //Костенюк Александр-Финиш 18.09.2012
	 
	 Если ЭтотОбъект.проведен Тогда
		 ЭлементыФормы.ДисконтнаяКарта.Доступность = Ложь;
		 ЭлементыФормы.Сертификат.Доступность = Ложь;
	 иначе                                                                 
		 ЭлементыФормы.ДисконтнаяКарта.Доступность = Истина;
		 ЭлементыФормы.Сертификат.Доступность = Истина;
		 
		 Если  ЭлементЗначение = Неопределено Тогда
		 	ЭлементЗначение = ЭтотОбъект.Сертификат;
		КонецЕсли;
		
		 Если ЗначениеЗаполнено(ЭлементЗначение) Тогда	 
			 Проверка = ЗначениеЗаполнено(ЭлементЗначение.ДисконтнаяКарта);	 		 
			 Если ЭлементЗначение.ВидСертификата.НеобходимаДисконтнаяКатрочка Тогда		 
				 ЭлементыФормы.ДисконтнаяКарта.Доступность = Ложь;		 
				 Если не Проверка Тогда
					 ЭлементыФормы.ДисконтнаяКарта.Значение = Неопределено;
				 Иначе
					 ЭлементыФормы.ДисконтнаяКарта.Значение = ЭлементЗначение.ДисконтнаяКарта;
				 КонецЕсли;		 
			 Иначе		 
				 Если не Проверка Тогда
					 ЭлементыФормы.ДисконтнаяКарта.Значение = Неопределено;
				 КонецЕсли;			 
			 КонецЕсли;
		 Иначе 
			 			 		ЭлементыФормы.ДисконтнаяКарта.Доступность = Истина;
								 
		 КонецЕсли;
		 ОбработкаТабличныхЧастей.РассчитатьСуммыПриПродаже(ЭтотОбъект, Позиции);		 
	 КонецЕсли;
	 
 КонецПроцедуры
 
 // Игорь 15.09.2011 15:51:26
 Функция ПолучитьТекстЗапросаПоКарточкам(ЗначениеПоиска = Неопределено, Количество = 0) Экспорт				
		
		Текст ="ВЫБРАТЬ
		|	ИнформационныеКарты.Ссылка
		|ИЗ
		|	Справочник.ИнформационныеКарты КАК ИнформационныеКарты
		|ГДЕ
		|	ИнформационныеКарты.КодКарты ПОДОБНО &Значение
		|	И (НЕ ИнформационныеКарты.ПометкаУдаления)";
		
		Если  ЗначениеПоиска ="Значение" тогда
			Текст = СтрЗаменить(Текст, "ВЫБРАТЬ", "ВЫБРАТЬ ПЕРВЫЕ 1");
			Текст = СтрЗаменить(Текст, "ИнформационныеКарты.КодКарты ПОДОБНО &Значение", "ИнформационныеКарты.КодКарты = &Значение");
		ИначеЕсли ЗначениеПоиска = "Ссылка" Тогда	
			Текст = СтрЗаменить(Текст, "ВЫБРАТЬ", "ВЫБРАТЬ ПЕРВЫЕ 1");
			Текст = СтрЗаменить(Текст, "ИнформационныеКарты.КодКарты ПОДОБНО &Значение", "ИнформационныеКарты.Ссылка = &Ссылка");		
		КонецЕсли;	
		
		Если ЗначениеПоиска = Неопределено и Количество > 0 Тогда
			Текст = СтрЗаменить(Текст , "ВЫБРАТЬ", "ВЫБРАТЬ ПЕРВЫЕ " + Количество)  
		КонецЕсли;

		Возврат Текст;			
		
	КонецФункции
